app/views/comments/_comment.html.erb

<div class="alert alert-secondary" id="comment_<%= comment.id %>">
	<h5><%= comment.user.first_name + " " + comment.user.last_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]