app/views/adverts/index.html.erb

					<div class="card-body">
						<h5 class="card-title"><%= advert.user.first_name + " " + advert.user.last_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]