app/controllers/adverts_controller.rb

	def create
		@advert.user_id = current_user.id
		if @advert.save
---
INSERT INTO "adverts" ("description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "VZvzvz"], ["created_at", "2018-10-24 09:47:30.196619"], ["updated_at", "2018-10-24 09:47:30.196619"], ["user_id", 1]]

	def show
		@comments = Comment.where(advert_id: @advert).order("created_at DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."advert_id" = 1 ORDER BY created_at DESC

	def destroy
		@advert.destroy
---
DELETE FROM "adverts" WHERE "adverts"."id" = $1  [["id", 2]]