app/controllers/comments_controller.rb

	def create
		@comment = @advert.comments.create(params[:comment].permit(:content))
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "advert_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", ""], ["created_at", "2018-10-24 09:00:59.837886"], ["updated_at", "2018-10-24 09:00:59.837886"], ["advert_id", 1], ["user_id", 1]]

	def update
		if @comment.update(params[:comment].permit(:content))
---
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "sadsgaadsg"], ["updated_at", "2018-10-25 21:34:11.616700"], ["id", 3]]

	def find_advert
		@advert = Advert.find(params[:advert_id])
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def find_comment
		@comment = @advert.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."advert_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["advert_id", 4], ["id", 3], ["LIMIT", 1]]