app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at
---
	def index
		@users = User.all.order("created_at")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def find_user
		@user = User.find(params[:id])